Get the value property as floats.
  Namespace:   Autodesk.Revit.DB.Visual
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
 Syntax
  C#
public IList<float> GetValueAsFloats()
  Visual Basic
Public Function GetValueAsFloats As IList(Of Single)
  Visual C++
public:
IList<float>^ GetValueAsFloats()
 See Also
  AssetPropertyDoubleArray4d Class
  Autodesk.Revit.DB.Visual Namespace